{
  "title": "Fighting Battles",
  "default_translation": "ESV",
  "days": [
    {
      "day": 1,
      "passage": "{{translation}}: Ephesians 6:10-13",
      "overview": "Paul reveals that our true battle is not against flesh and blood but against spiritual forces. Believers must be strong in the Lord and put on the full armor of God to stand firm against spiritual schemes.",
      "reflection": "What does it mean that our struggle is not against flesh and blood? How do you strengthen yourself in the Lord? What spiritual battles are you currently facing?",
      "prayer": "Ask God to open your eyes to the spiritual nature of your struggles and to strengthen you in Him."
    },
    {
      "day": 2,
      "passage": "{{translation}}: Ephesians 6:14-17",
      "overview": "Paul describes each piece of spiritual armor: truth, righteousness, the gospel of peace, faith, salvation, and the Word of God. Each piece protects believers in spiritual warfare and enables them to stand firm.",
      "reflection": "Which pieces of armor do you need to put on more intentionally? How does God's Word function as a sword? What does it mean to have your feet fitted with readiness from the gospel?",
      "prayer": "Pray for God's help in daily putting on each piece of spiritual armor."
    },
    {
      "day": 3,
      "passage": "{{translation}}: 2 Corinthians 10:3-5",
      "overview": "Paul explains that though we live in the world, we don't wage war as the world does. Our weapons have divine power to demolish strongholds and take every thought captive to obey Christ.",
      "reflection": "What are the divine weapons available to believers? What mental strongholds need to be demolished in your life? How can you take thoughts captive to obey Christ?",
      "prayer": "Ask God to demolish spiritual strongholds and help you bring every thought into obedience to Christ."
    },
    {
      "day": 4,
      "passage": "{{translation}}: James 4:7",
      "overview": "James provides a simple but powerful strategy: submit to God, resist the devil, and he will flee. Victory comes through surrender to God and active resistance against evil.",
      "reflection": "What does submission to God look like in your daily life? How do you actively resist the devil? What areas need greater submission?",
      "prayer": "Pray for the grace to fully submit to God and the strength to resist temptation and spiritual attack."
    }
  ]
}