{
  "title": "Hearing God's Word",
  "default_translation": "ESV",
  "days": [
    {
      "day": 1,
      "passage": "{{translation}}: James 1:22-25",
      "overview": "James warns against merely hearing the Word without doing what it says. True disciples look intently into God's Word and act on it, experiencing blessing in their obedience.",
      "reflection": "Are you a hearer only or also a doer of the Word? What is one truth from Scripture you need to obey more fully? How does the Word serve as a mirror for your soul?",
      "prayer": "Ask God to help you not just hear His Word but actively obey it in all areas of life."
    },
    {
      "day": 2,
      "passage": "{{translation}}: Matthew 7:24-27",
      "overview": "Jesus compares those who hear and obey His words to a wise builder on rock, while those who hear but don't obey are like a fool building on sand. When storms come, only the obedient stand firm.",
      "reflection": "What foundation is your life built on? What storms have revealed the strength or weakness of your spiritual foundation? How can you build more firmly on Christ's words?",
      "prayer": "Pray for wisdom to build your life on the solid foundation of obedience to God's Word."
    },
    {
      "day": 3,
      "passage": "{{translation}}: Luke 8:15",
      "overview": "In explaining the parable of the sower, Jesus describes good soil as those who hear the word with an honest and good heart, hold it fast, and bear fruit with patience. The condition of our hearts determines fruitfulness.",
      "reflection": "What kind of soil is your heart? What prevents the Word from bearing fruit in your life? How can you cultivate a heart that receives and retains God's Word?",
      "prayer": "Ask God to prepare your heart as good soil that receives His Word and bears lasting fruit."
    },
    {
      "day": 4,
      "passage": "{{translation}}: Romans 10:17",
      "overview": "Paul explains that faith comes from hearing, and hearing through the word of Christ. The Word is the means by which God builds our faith and draws people to salvation.",
      "reflection": "How has hearing God's Word strengthened your faith? Who needs to hear the word of Christ from you? How can you prioritize hearing and meditating on Scripture?",
      "prayer": "Thank God for His Word and pray for opportunities to share it with others who need to hear."
    }
  ]
}