{
  "title": "Honoring God Daily",
  "default_translation": "ESV",
  "days": [
    {
      "day": 1,
      "passage": "{{translation}}: 1 Corinthians 10:31",
      "overview": "Paul teaches that whether we eat or drink or whatever we do, everything should be done for God's glory. No action is too mundane or ordinary to be an act of worship when done for God's honor.",
      "reflection": "How can everyday activities like eating and drinking bring glory to God? What would change if you did everything consciously for God's glory? What areas of life need to be reoriented toward honoring God?",
      "prayer": "Ask God to help you live every moment for His glory, making all of life an act of worship."
    },
    {
      "day": 2,
      "passage": "{{translation}}: Colossians 3:23-24",
      "overview": "Paul instructs believers to work heartily as for the Lord rather than for men, knowing they will receive an inheritance as reward. Even ordinary work becomes sacred service when done for Christ.",
      "reflection": "How does working for the Lord change your attitude toward your daily tasks? What would change if you truly saw your work as service to Christ? How does the promise of eternal reward motivate you?",
      "prayer": "Pray for a heart that serves the Lord wholeheartedly in all work, not merely pleasing people."
    },
    {
      "day": 3,
      "passage": "{{translation}}: Romans 12:1-2",
      "overview": "Paul urges believers to present their bodies as living sacrifices, holy and acceptable to God—this is their spiritual worship. Rather than conforming to the world, they should be transformed by renewing their minds.",
      "reflection": "What does it mean to be a living sacrifice? In what ways are you tempted to conform to the world's patterns? How is your mind being renewed?",
      "prayer": "Offer yourself completely to God as a living sacrifice and ask Him to transform your thinking."
    },
    {
      "day": 4,
      "passage": "{{translation}}: Psalm 19:14",
      "overview": "David prays that the words of his mouth and the meditation of his heart would be acceptable in God's sight. This reflects a heart concerned with honoring God in both speech and inward thoughts.",
      "reflection": "Are your words and thoughts pleasing to God? What changes when you view God as your Rock and Redeemer? How can you be more mindful of honoring God in your speech and thoughts?",
      "prayer": "Pray that all your words and inward thoughts would be acceptable to the Lord."
    }
  ]
}