{
  "title": "Life in the Spirit",
  "default_translation": "ESV",
  "days": [
    {
      "day": 1,
      "passage": "{{translation}}: Romans 8:5-11",
      "overview": "Paul contrasts life in the flesh with life in the Spirit. Those who set their minds on the Spirit have life and peace, while the mind set on the flesh is death. The Spirit gives life to mortal bodies.",
      "reflection": "What does it mean to set your mind on the Spirit versus the flesh? How does the Spirit give life to your mortal body? What areas of your thinking need to be reoriented?",
      "prayer": "Ask God to help you set your mind on the things of the Spirit and experience His life and peace."
    },
    {
      "day": 2,
      "passage": "{{translation}}: Galatians 5:16-18",
      "overview": "Paul commands believers to walk by the Spirit, promising they will not gratify the desires of the flesh. The flesh and Spirit are in conflict, but those led by the Spirit are not under law.",
      "reflection": "What does it mean to walk by the Spirit? How do you experience the conflict between flesh and Spirit? What desires of the flesh are you struggling against?",
      "prayer": "Pray for the power to walk by the Spirit consistently and overcome fleshly desires."
    },
    {
      "day": 3,
      "passage": "{{translation}}: Galatians 5:22-23",
      "overview": "Paul lists the fruit of the Spirit: love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, and self-control. These qualities are evidence of the Spirit's transforming work in believers' lives.",
      "reflection": "Which fruit of the Spirit is most evident in your life? Which needs more cultivation? How does the Spirit produce this fruit in you?",
      "prayer": "Ask the Holy Spirit to produce His fruit abundantly in your life, making you more like Christ."
    },
    {
      "day": 4,
      "passage": "{{translation}}: Romans 8:13-14",
      "overview": "Paul teaches that by the Spirit believers must put to death the deeds of the body to truly live. Those led by God's Spirit are His children, revealing their identity through Spirit-led living.",
      "reflection": "What deeds of the body do you need to put to death? How does the Spirit lead you? What does it mean to be a child of God?",
      "prayer": "Pray for the Spirit's power to put sin to death and for sensitivity to His leading in your life."
    }
  ]
}