{
  "title": "Overcoming Temptation",
  "default_translation": "ESV",
  "days": [
    {
      "day": 1,
      "passage": "{{translation}}: 1 Corinthians 10:13",
      "overview": "Paul assures believers that no temptation has overtaken them that is not common to man. God is faithful and will provide a way of escape so they can endure it.",
      "reflection": "How does knowing temptation is common to humanity help you? What does God's faithfulness in temptation look like? What ways of escape has God provided?",
      "prayer": "Thank God for His faithfulness in temptation and ask Him to help you recognize and take the way of escape."
    },
    {
      "day": 2,
      "passage": "{{translation}}: James 1:13-15",
      "overview": "James clarifies that God does not tempt anyone. Rather, each person is tempted by their own desire, which when it conceives gives birth to sin, and sin when fully grown brings death.",
      "reflection": "What desires make you vulnerable to temptation? How does understanding sin's progression help you resist earlier? What 'death' results from giving in to temptation?",
      "prayer": "Ask God to reveal and transform the desires that lead you into temptation."
    },
    {
      "day": 3,
      "passage": "{{translation}}: Matthew 26:41",
      "overview": "Jesus instructs His disciples to watch and pray so they won't enter into temptation. Though the spirit is willing, the flesh is weak—vigilance and prayer are essential defenses against temptation.",
      "reflection": "How does prayerfulness protect against temptation? Where do you need to be more watchful? When has your willing spirit been undermined by weak flesh?",
      "prayer": "Pray for vigilance and spiritual alertness to recognize and resist temptation before falling."
    },
    {
      "day": 4,
      "passage": "{{translation}}: Hebrews 4:15-16",
      "overview": "Jesus our High Priest has been tempted in every way as we are, yet without sin. Because He understands our weakness, we can confidently approach God's throne to receive mercy and grace for help in time of need.",
      "reflection": "How does Jesus' experience of temptation encourage you? What does it mean to approach God's throne with confidence? When do you need to seek grace for help?",
      "prayer": "Thank Jesus for understanding your temptations and ask for grace to overcome in your time of need."
    }
  ]
}