{
  "title": "Peace in Trials",
  "default_translation": "ESV",
  "days": [
    {
      "day": 1,
      "passage": "{{translation}}: John 14:27",
      "overview": "Jesus promises to give His peace—not as the world gives, but a supernatural peace. He commands disciples not to let their hearts be troubled or afraid, even facing His departure and future trials.",
      "reflection": "How is Jesus' peace different from the world's peace? What troubles your heart? How can you receive and maintain Christ's peace?",
      "prayer": "Ask Jesus to fill you with His peace that transcends circumstances and guards your heart from fear."
    },
    {
      "day": 2,
      "passage": "{{translation}}: Philippians 4:6-7",
      "overview": "Paul instructs believers not to be anxious but to bring everything to God in prayer with thanksgiving. The result is God's peace guarding their hearts and minds in Christ Jesus.",
      "reflection": "What anxieties do you need to bring to God in prayer? How does thanksgiving combat anxiety? How have you experienced God's peace guarding your heart?",
      "prayer": "Bring your specific anxieties to God with thanksgiving and ask for His peace to guard your heart."
    },
    {
      "day": 3,
      "passage": "{{translation}}: Isaiah 26:3",
      "overview": "Isaiah promises that God will keep in perfect peace those whose minds are stayed on Him, because they trust in Him. Peace comes from fixing our thoughts on God's character and trusting His control.",
      "reflection": "Where is your mind fixed right now? What does it mean to keep your mind stayed on God? How does trust produce peace?",
      "prayer": "Pray for help to keep your mind fixed on God and to trust Him completely, experiencing His perfect peace."
    },
    {
      "day": 4,
      "passage": "{{translation}}: Romans 5:1",
      "overview": "Paul declares that since believers are justified by faith, they have peace with God through Jesus Christ. This is not peace as a feeling but peace as a status—reconciliation with God.",
      "reflection": "What does peace with God mean? How does justification produce peace? How should peace with God affect your daily life?",
      "prayer": "Thank God for justifying you through faith and giving you peace with Him through Jesus Christ."
    }
  ]
}