{
  "title": "Trusting God's Timing",
  "default_translation": "KJV",
  "days": [
    {
      "day": 1,
      "passage": "{{translation}}: Ecclesiastes 3:1",
      "overview": "Solomon declares there is a time for everything and a season for every activity under heaven. God orders events according to His perfect timing, not ours.",
      "reflection": "What are you impatient about? How does trusting God's timing change your perspective? What season are you in right now?",
      "prayer": "Ask God to help you trust His perfect timing and find peace in your current season."
    },
    {
      "day": 2,
      "passage": "{{translation}}: Habakkuk 2:3",
      "overview": "God tells Habakkuk that the vision awaits its appointed time and will surely come, not delay. Though it seems slow, wait for it—God's timing is always perfect, never late.",
      "reflection": "What promises are you waiting for? How can you wait patiently when God seems slow? What does it mean that the vision will surely come?",
      "prayer": "Pray for patience to wait on God's timing, trusting that He will fulfill His promises."
    },
    {
      "day": 3,
      "passage": "{{translation}}: Psalm 27:14",
      "overview": "David exhorts: Wait for the Lord; be strong, and let your heart take courage; wait for the Lord! Waiting requires strength and courage, not passive resignation.",
      "reflection": "What makes waiting on God difficult? How can waiting be an act of strength? Where do you need courage to wait?",
      "prayer": "Ask God for strength and courage to actively wait on His perfect timing."
    },
    {
      "day": 4,
      "passage": "{{translation}}: Isaiah 40:31",
      "overview": "Isaiah promises that those who wait for the Lord shall renew their strength, mount up with wings like eagles, run without weariness, and walk without fainting.",
      "reflection": "How does waiting on God renew your strength? What does it mean to soar like eagles? When have you experienced this renewed strength?",
      "prayer": "Wait on the Lord and ask Him to renew your strength for whatever lies ahead."
    }
  ]
}