{
  "book": "metadata",
  "chapters": {
    "name": "Authorized King James Version",
    "shortname": "KJV",
    "module": "kjv",
    "year": "1611 / 1769",
    "publisher": null,
    "owner": null,
    "description": "\r\n<h2 align=\"center\">The Authorized King James Version of 1611</h2>\r\n<p align=\"center\">1769 Edition, Red-Letter, w/Chapter Headings, Translator's Notes v1.3</p>\r\n<p>The version which was destined to put the crown on nearly a century of labor, and, after extinguishing by its excellence all rivals, to print an indelible mark on English religion and English literature, came into being almost by accident. It arose out of the Hampton Court Conference, held by James I in 1604, with the object of arriving at a settlement between the Puritan and Anglican elements in the Church; but it was not one of the prime or original subjects of the conference. In the corse of discussion, Dr. Reynolds, president of Corpus Christi College, Oxford, the leader of the moderate Puritan party, referred to the imperfections and disagreements of the existing translations; and the suggestion of a new version, to be prepared by the best scholars in the country, was warmly taken up by the king. The conference, as a whole, was a failure; but James did not allow the idea of the revision to drop. He took an active part in the preparation of instructions for the work, and to him appears to be due the credit of two features which went far to secure its success. He suggested that the translation should be committed in the first instance to the universities (subject to subsequent review by the bishops and the Privy Council, which practically came to nothing), and thereby secured the services of the best scholars in the country, working in cooperation; and (on the suggestion of the bishop of London) he laid down that no marginal notes should be added, which preserved the new version from being the organ of any one party in the Church.<br><br> \r\nUltimately it was arranged that six companies of translators should be formed, two at Westminster, two at Oxford, and two at Cambridge. The companies varied in strength from 7 to 10 members, the total (though there is some little doubt with regard to a few names) being 47. The Westminster companies undertook Genesis to 2 Kings and the Epistles, the Oxford companies the Prophets and the Gospels, Acts, and Apocalypse, and the Cambridge companies 1 Chronicles to Ecclesiastes and the Apocrypha. A series of rules was drawn up for their guidance. The Bishop's Bible was to be taken as the basis. The old ecclesiastical terms were to be kept. No marginal notes were to be affixed, except for the explanation of Hebrew or Greek words. Marginal references, on the contrary, were to be supplied. As each company finished a book, it was to send it to the other companies for their consideration. Suggestions were to be invited from the clergy generally, and opinions requested on passages of special difficulty from any learned man in the land. \"These translations to be used when they agree better with the text than the Bishops' Bible, namely, Tyndale's, Matthew's, Coverdale's, Whitchurch's (i.e. the Great Bible), Geneva.\" The translators claim further to have consulted all the available versions and commentaries in other languages, and to have repeatedly revised their own work, without grudging the time which it required. The time occupied by the whole work is stated by themselves as two years and three-quarters. The several companies appear to have begun their labors about the end of 1607, and to have taken two years in completing their several shares. A final revision, occupying nine months, was then made by a smaller body, consisting of two representatives from each company, after which it was seen through the press by Dr. Miles Smith and Bishop Bilson; and in 1611 the new version, printed by R. Barker, the king's printer, was given to the world in a large folio volume (the largest of all the series of English Bibles) of black letter type. The details of its issue are obscure. There were at least two issues in 1611, set up independently, known respectively as the \"He\" and \"She\" Bibles, from their divergence in the translation of the last words of Ruth 3:15; and bibliographers have differed as to their priority, though the general opinion is in favor of the former. 1 Some copies have a wood-block, others an engraved title-page, with different designs. The title-page was followed by the dedication to King James, which still stands in our ordinary copies of the Authorized Version, and this by the translators' preface (believed to have been written by Dr. Miles Smith), which is habitually omitted. (It is printed in the present King's Printers' Variorum Bible, and is interesting and valuable both as an example of the learning of the age and for its description of the translators' labors.) For the rest, the contents and arrangement of the Authorized Version are too well known to every reader to need description.<br><br> \r\nNor is it necessary to dwell at length on the characteristics of the translation. Not only was it superior to all its predecessors, but its excellence was so marked that no further revision was attempted for over 250 years. Its success must be attributed to the fact which differentiated it from its predecessors, namely, that it was not the work of a single scholar (like Tyndale's, Coverdale's, and Matthew's Bibles), or of a small group (like the Geneva and Douai Bibles), or of a large number of men working independently with little supervision (like the Bishops' Bible), but was produced by the collaboration of a carefully selected band of scholars, working with ample time and with full and repeated revision. Nevertheless, it was not a new translation. It owed much to its predecessors. The translators themselves say, in their preface: \"We never thought from the beginning that we should need to make a new translation, nor yet to make of a bad one a good one, ... but to make a good one better, or out of many good ones one principal good one, not justly to be excepted against; that hath been our endeavor, that our mark.\" The description is very just. The foundations of the Authorized Version were laid by Tyndale, and a great part of his work continued through every revision. Each succeeding version added something to the original stock, Coverdale (in his own and the Great Bible) and the Genevan scholars contributing the largest share; and the crown was set upon the whole by the skilled labor of the Jacobean divines, making free use of the materials accumulated by others, and happily inspired by the gift of style which was the noblest literary achievement of the age in which they lived. A sense of the solemnity of their subject saved them from the extravagances and conceits which sometimes mar that style; and, as a result, they produced a work which, from the merely literary point of view, is the finest example of Jacobean prose, and has influenced incalculably the whole subsequent course of English literature. On the character and spiritual history of the nation it has left an even deeper mark, to which many writers have borne eloquent testimony; and if England has been, and is, a Bible-reading and Bible-loving country, it is in no small measure due to her possession of a version so nobly executed as the Authorized Version.<br><br> \r\nThe history of the Authorized Version after 1611 can be briefly sketched. In spite of the name by which it is commonly known, and in spite of the statement on both title-pages of 1611 that it was \"appointed to be read in churches,\" there is no evidence that it was ever officially authorized either by the Crown or by Convocation. Its authorization seems to have been tacit and gradual. The Bishops' Bible, hitherto the official version, ceased to be reprinted, and the Authorized Version no doubt gradually replaced it in churches as occasion arose. In domestic use its fortunes were for a time more doubtful, and for two generations it existed concurrently with the Geneva Bible; but before the century was out its predominance was assured. The first quarto and octavo editions were issued in 1612; and thenceforth editions were so numerous that it is useless to refer to any except a few of them. The early editions were not very correctly printed. In 1638 an attempt to secure a correct text was made by a small group of Cambridge scholars. In 1633 the first edition printed in Scotland was published. In 1701 Bishop Lloyd superintended the printing of an edition at Oxford, in which Archbishop Ussher's dates for Scripture chronology were printed in the margin, where they henceforth remained. In 1717 a fine edition, printed by Baskett at Oxford, earned bibliographical notoriety as \"The Vinegar Bible\" from a misprint in the headline over Luke 20. 2 In 1762 a carefully revised edition was published at Cambridge under the editorship of Dr. T. Paris, and a similar edition, superintended by Dr. B. Blayney, appeared at Oxford in 1769. These two editions, in which the text was carefully revised, the spelling modernized, the punctuation corrected, and considerable alteration made in the marginal notes, formed the standard for subsequent reprints of the Authorized Version, which differ in a number of details, small in importance but fairly numerous in the aggregate, from the original text of 1611. One other detail remains to be mentioned. In 1666 appeared the first edition of the Authorized Version from which the Apocrypha was omitted. It had previously been omitted from some editions of the Geneva Bible, from 1599 onwards. The Nonconformists took much objection to it, and in 1664 the Long Parliament forbade the reading of lessons from it in public; but the lectionary of the English Church always included lessons from it. The example of omission was followed in many editions subsequently. The first edition printed in America (apart from a surreptitious edition of 1752), in 1782, is without it. In 1826 the British and Foreign Bible Society, which has been one of the principal agents in the circulation of the Scriptures throughout the world, decided never in the future to print or circulate copies containing the Apocrypha; and this decision has been carried into effect ever since.<br><br> \r\n</p><p>Frederic G. Kenyon (excerpt)</p> <br /><br />This Bible imported from Bible Analyzer <a href='http://www.bibleanalyzer.com/download.htm'>http://www.bibleanalyzer.com/download.htm</a>",
    "lang": "English",
    "lang_short": "en",
    "copyright": 0,
    "copyright_statement": "This Bible is in the Public Domain in most parts of the world.  However, in the United Kingdom, it is under perpetual Crown copyright.",
    "url": null,
    "citation_limit": 0,
    "restrict": 0,
    "italics": 1,
    "strongs": 0,
    "red_letter": 0,
    "paragraph": 0,
    "official": 1,
    "research": 0,
    "module_version": "5.6.1"
  }
}