{
  "title": "God's Providence",
  "default_translation": "ESV",
  "days": [
    {
      "day": 1,
      "passage": "{{translation}}: Genesis 50:20",
      "overview": "Joseph tells his brothers that though they meant evil against him, God meant it for good, to bring about the saving of many lives. God works through even evil intentions.",
      "reflection": "When has God brought good from evil circumstances? How do you trust God's purposes in suffering? What does divine providence mean?",
      "prayer": "Thank God for working all things together for good, even when you don't understand."
    },
    {
      "day": 2,
      "passage": "{{translation}}: Romans 8:28",
      "overview": "Paul declares that for those who love God and are called according to His purpose, He works all things together for good. God sovereignly orchestrates circumstances for believers' benefit.",
      "reflection": "What difficult circumstances are you trusting God to use for good? How do you love God in the midst of trials? What is God's purpose for you?",
      "prayer": "Trust God to work all things together for your good according to His purpose."
    },
    {
      "day": 3,
      "passage": "{{translation}}: Proverbs 16:9",
      "overview": "Solomon writes that the heart of man plans his way, but the Lord establishes his steps. Human planning is subject to divine providence—God directs our paths.",
      "reflection": "How do you balance planning with trusting God? When has God redirected your plans? How do you submit your plans to God?",
      "prayer": "Ask God to establish your steps and direct your path according to His will."
    },
    {
      "day": 4,
      "passage": "{{translation}}: Matthew 10:29-31",
      "overview": "Jesus teaches that not even a sparrow falls to the ground apart from the Father, and believers are more valuable than many sparrows. God's providence extends to the smallest details.",
      "reflection": "How does God's care for sparrows comfort you? What details of your life are under God's care? How valuable are you to God?",
      "prayer": "Thank God for His detailed care over every aspect of your life."
    },
    {
      "day": 5,
      "passage": "{{translation}}: Ephesians 1:11",
      "overview": "Paul declares that believers have obtained an inheritance, having been predestined according to the purpose of Him who works all things according to the counsel of His will.",
      "reflection": "What does it mean that God works all things according to His will? How does God's sovereignty comfort you? What inheritance awaits you?",
      "prayer": "Praise God for His sovereign control over all things and for securing your inheritance."
    },
    {
      "day": 6,
      "passage": "{{translation}}: Psalm 139:16",
      "overview": "David declares that God saw his unformed substance and in His book were written all the days that were formed for him, when as yet there were none. God ordained every day before they came to be.",
      "reflection": "What does it mean that God ordained your days? How does this truth affect your view of life's events? How do you trust God's plan for your days?",
      "prayer": "Thank God for ordaining all your days and trust His plan for your life."
    },
    {
      "day": 7,
      "passage": "{{translation}}: Isaiah 46:9-10",
      "overview": "God declares the end from the beginning, proclaiming things not yet done, saying His counsel shall stand and He will accomplish all His purpose. God's plans cannot be thwarted.",
      "reflection": "What does God's declaration of the end from the beginning mean? How do you trust that God's counsel will stand? What purposes of God do you see unfolding?",
      "prayer": "Worship God for His sovereignty and unchangeable purposes that will surely come to pass."
    }
  ]
}