{
  "title": "The Holy Spirit's Work",
  "default_translation": "ESV",
  "days": [
    {
      "day": 1,
      "passage": "{{translation}}: John 14:16-17",
      "overview": "Jesus promises to send another Helper who will be with believers forever—the Spirit of truth whom the world cannot receive. He dwells with and will be in believers.",
      "reflection": "Who is the Holy Spirit? What does it mean that He is your Helper? How is the Spirit with you?",
      "prayer": "Thank Jesus for sending the Holy Spirit and welcome His presence and help."
    },
    {
      "day": 2,
      "passage": "{{translation}}: John 16:7-11",
      "overview": "Jesus says it's advantageous for Him to go so the Helper can come. The Spirit convicts the world concerning sin, righteousness, and judgment.",
      "reflection": "How does the Spirit convict of sin? What is His role regarding righteousness and judgment? When have you experienced His conviction?",
      "prayer": "Thank God for the Spirit's convicting work and ask for sensitivity to His voice."
    },
    {
      "day": 3,
      "passage": "{{translation}}: Acts 1:8",
      "overview": "Jesus promises believers will receive power when the Holy Spirit comes upon them, making them witnesses in Jerusalem, Judea, Samaria, and to the end of the earth.",
      "reflection": "How does the Spirit give power? What does being His witness mean? Where is He sending you?",
      "prayer": "Ask the Holy Spirit to empower you to be Jesus' witness wherever you go."
    },
    {
      "day": 4,
      "passage": "{{translation}}: Romans 8:26-27",
      "overview": "Paul teaches that the Spirit helps in weakness, interceding with groanings too deep for words. He intercedes for the saints according to God's will.",
      "reflection": "How does the Spirit help your weakness? What does His intercession mean? How does this comfort you?",
      "prayer": "Thank the Spirit for interceding for you and trust His prayers on your behalf."
    },
    {
      "day": 5,
      "passage": "{{translation}}: 1 Corinthians 12:4-11",
      "overview": "Paul describes varieties of gifts, service, and activities—all empowered by the same Spirit who apportions to each individually as He wills for the common good.",
      "reflection": "What spiritual gifts has the Spirit given you? How do you use them for the common good? How does diversity of gifts reflect unity?",
      "prayer": "Thank the Spirit for your gifts and ask how to use them better for God's glory."
    },
    {
      "day": 6,
      "passage": "{{translation}}: Galatians 5:22-23",
      "overview": "Paul lists the fruit of the Spirit: love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control. This fruit evidences the Spirit's transforming work.",
      "reflection": "Which fruit is most evident in you? Which needs cultivation? How does the Spirit produce this fruit?",
      "prayer": "Ask the Spirit to produce His fruit abundantly in your life."
    },
    {
      "day": 7,
      "passage": "{{translation}}: Ephesians 5:18",
      "overview": "Paul commands believers not to be drunk with wine but be filled with the Spirit. Being Spirit-filled should characterize believers' lives.",
      "reflection": "What does being filled with the Spirit mean? How is this like or unlike drunkenness? How do you stay filled?",
      "prayer": "Ask to be continually filled with the Holy Spirit, yielding control to Him."
    }
  ]
}